# 30.	Вычислить число π c заданной точностью d.
#   	Пример: при d = 0.001,π = 3.141.10^(-1)≤d≤10^(-10)
#
d = int(input('Укажите требуемую точность (количество знаков после запятой < 8, плиз)  '))
e = 10 ** (- d)
print(f'd = {e}')
k = 0
P = 0
def p(k):
    return 4 * (-1)**k/(2*k+1)
while abs(p(k)) >= e:
    P += p(k)    
    k += 1
print(f'P = {round(P, d)}')