# 25.	Написать программу преобразования десятичного числа в двоичное.
#
# num = int(input('Введите число '))
# binnum = ''
# while num != 0:
#     binnum = str(num%2) + binnum
#     num //= 2
# print(binnum) 