# 28.	Найти корни квадратного уравнения Ax² + Bx + C = 0.
#
a = float(input('Введите коэффициент А = '))
b = float(input('Введите коэффициент В = '))
c = float(input('Введите свободный член С = '))
d = b**2 - 4 * a * c
if d < 0:
    print('Вещественных корней нет')
elif d == 0:
    print(f'X = {(- b)/(2*a)}')
else:
    print(f'X1 = {round((- b - d**(1/2))/(2*a),2)}\nX2 = {round((- b + d**(1/2))/(2*a),2)}')